# ClassNum

## Description
Returns the total number of classes in the active document.

```pascal
FUNCTION ClassNum : LONGINT;
```

```python
def vs.ClassNum():
    return LONGINT
```

## Examples
```pascal
numOfClasses:= ClassNum;

```

## Version
Availability: from MiniCAD
## Category
* Classes